SPedt/src/Documents/Выгрузка_100СП/Выгрузка_100СП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Выгрузка_100СП</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтпавкиНаСайт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыгружаемыДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>типОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменен</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыгружаемыеДанные</name>
    <attributes>
      <name>Мегаордер</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>типОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартияЗаказа</name>
      <type>
        <types>DefinedType.ПартияПоступления</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыгружаемыеДанныеТК</name>
    <attributes>
      <name>Мегаордер</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>типОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПартияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлениеТранзита</name>
      <type>
        <types>DocumentRef.ОтправлениеТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрекНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаЯндекс</name>
  </enumValues>
  <enumValues>
    <name>КурьерскаяДоставка</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОплаты</name>
  </enumValues>
  <enumValues>
    <name>ГруппыДоставкиЗапросОтсрочки</name>
  </enumValues>
  <enumValues>
    <name>ПотерянныеЗаказы</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаСправочников</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

SPedt/src/Documents/Выгрузка_100СП/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНеОтправленнымиНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Выгрузка_100СП"));
	об.ЗаполнитьНеОтправленными();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНеОтправленными(Команда)
	ЗаполнитьНеОтправленнымиНаСервере();
	Модифицированность=Истина;
КонецПроцедуры



&НаКлиенте
Процедура Отправить(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Выгрузка_100СП"));
	об.ВыгрузитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры




&НаСервере
Функция  ПросмотрXMLНаСервере()
	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.Выгрузка_100СП"));
	Возврат об.СкомпоноватьДляВыгрузки();
КонецФункции

&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);

КонецПроцедуры



&НаКлиенте
Процедура ПросмотрХМЛэлемента(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	ТекущиеДанные=Новый структура("Партия, СтрокавПартии, типОбмена");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.ВыгружаемыеДанные.ТекущиеДанные);
	хмл=ПросмотрХМЛэлементаНаСервере(ТекущиеДанные);
	СтоСП_Клиент.Показать_XML(хмл);
КонецПроцедуры

Функция ПросмотрХМЛэлементаНаСервере(ТекущиеДанные)
	Если ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.Приход Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_Income(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
		
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.Возврат Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_return(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.ПередачаВозврата Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_discard(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.Списание Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_discard(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.СуперГруппа Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_superGroup(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.СуперГруппаРегистрация Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_superGroupReceipt(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.СуперГруппаКолено Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_superGroupStage(ТекущиеДанные.Партия);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.Расход Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_delivery(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.Транзит Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_transfer(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
	ИначеЕсли ТекущиеДанные.типОбмена=Перечисления.ТипыОбменов100сп.ГруппыДоставкиЗапросОплаты Тогда
		Возврат Документы[ТекущиеДанные.Партия.Метаданные().Имя].ПолучитьТэг_groupBill(ТекущиеДанные.Партия,ТекущиеДанные.СтрокавПартии);
		
	КонецЕсли;
	Возврат "";
КонецФункции



&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл=Элементы.ПротоколыПередач.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл);
КонецПроцедуры




&НаКлиенте
Процедура ВыгружаемыДокументыПриАктивизацииСтроки(Элемент)
	Если Элемент.текущиеДанные=неопределено Тогда Возврат;
		Элементы.ВыгружаемыеДанные.ОтборСтрок=новый ФиксированнаяСтруктура("Партия,типОбмена",Неопределено,Неопределено);
	Иначе	
		Элементы.ВыгружаемыеДанные.ОтборСтрок=новый ФиксированнаяСтруктура("Партия,типОбмена",Элемент.текущиеДанные.Документ,Элемент.текущиеДанные.типОбмена);
 	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если не ЗначениеЗаполнено(Объект.Статус) Тогда
		Объект.Статус=Перечисления.СтатусОтпавкиНаСайт.Сформирован;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	Элементы.ВыгружаемыеДанные.ОтборСтрок=Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура ВыгружаемыДокументыПередУдалением(Элемент, Отказ)
	масс_Поиска = Объект.ВыгружаемыеДанные.НайтиСтроки(Новый Структура("Партия",Элемент.ТекущиеДанные.Документ));
	Для каждого элем из масс_Поиска Цикл
		 Объект.ВыгружаемыеДанные.Удалить(элем.НомерСтроки-1);	
	КонецЦикла;	
КонецПроцедуры
